src_Extension/Reports/МатериалыИКомплектующиеНаСписокИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>МатериалыИКомплектующиеНаСписокИзделий</Name>
			<Comment>ОМТС</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазузловыватьПолуфабрикатыПроизводимыеНаСтороне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Изделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>26</v8:Digits>
									<v8:FractionDigits>13</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументУстановкиЦен</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаСкладе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изделие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзмДок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаДок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетРазрешениеНаЗамену</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетРазрешениеНаЗамену1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпецификацияИ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src_Extension/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_Extension/InformationRegisters/РасценкиРаботСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасценкиРаботСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КвалификационныйРазряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_Extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>15</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_Extension/Reports/МатериалыИКомплектующиеНаСписокИзделий/Ext/ObjectModule.bsl
&НаСервере
Перем СтатьяКалькуляцииТехотход;  
Перем СтатьяКалькуляцииПокупныеКомплектующие;
Перем СтатьяКалькуляцииПокупныеМатериалы;
Перем СтатьяКалькуляцииЗамена;
//Перем СтатьяКалькуляцииПолуфабрикаты;

Перем ТЗСпецификации;
Перем ТЗМатериалы;
Перем ТЗОстатки; //СвободныеОстатки или ОстаткиНаСкладах?

Функция ПолучитьЗначениеПараметра(ИмяПараметра, ЗначениеПоУмолчанию = Неопределено)
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если НайденныйПараметрВарианта = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	// Сначала проверяем пользовательские настройки
	Если ЗначениеЗаполнено(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки) Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
		Если НайденныйПараметр <> Неопределено Тогда
			Если НайденныйПараметр.Использование Тогда
				Возврат НайденныйПараметр.Значение;
			Иначе
				Возврат ЗначениеПоУмолчанию; // Параметр отключен пользователем
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Если в пользовательских настройках не найдено - берём из настроек варианта
	Если НайденныйПараметрВарианта.Использование Тогда
		Возврат НайденныйПараметрВарианта.Значение;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиспетчерыВыпуска = ПолучитьЗначениеПараметра("ДиспетчерыВыпуска");
	Если НЕ ЗначениеЗаполнено(ДиспетчерыВыпуска) тогда
		ДиспетчерыВыпуска = Null;
	КонецЕсли;
	
	Период = ПолучитьЗначениеПараметра("Период");
	Если Период <> Неопределено И ЗначениеЗаполнено(Период.ДатаНачала) тогда
		ПолучитьПланПроизводства(Период.ДатаНачала, Период.ДатаОкончания, ДиспетчерыВыпуска);
	КонецЕсли;
	
	Склады = ПолучитьЗначениеПараметра("Склады");
	
	РазузловыватьПолуфабрикатыПроизводимыеНаСтороне = ПолучитьЗначениеПараметра("РазузловыватьПолуфабрикатыПроизводимыеНаСтороне", Ложь);
	
	МенеджерВТ = Неопределено;
	РассчитатьМатериалы(Склады, МенеджерВТ);
	
	Трудозатраты = РасчитатьТрудозатраты(МенеджерВТ);
	ЗаполнитьКоличествоИзделий(Трудозатраты);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Материалы", Материалы);
	ВнешниеНаборыДанных.Вставить("Изделия", Изделия);
	ВнешниеНаборыДанных.Вставить("Трудозатраты", Трудозатраты);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
					КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
					//КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
 	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры

&НаСервере

Процедура ПолучитьПланПроизводства(ДатаНачала, ДатаОкончания, ДиспетчерыВыпуска)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказНаПроизводство2_2Продукция.КоличествоУпаковок) КАК Количество,
		|	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЭтапПроизводства2_2.Распоряжение КАК Распоряжение
		|		ИЗ
		|			Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|		ГДЕ
		|			ЭтапПроизводства2_2.Проведен) КАК Этапы
		|		ПО ЗаказНаПроизводство2_2Продукция.Ссылка = Этапы.Распоряжение
		|ГДЕ
		|	ЗаказНаПроизводство2_2Продукция.Ссылка.Проведен
		|	И ЗаказНаПроизводство2_2Продукция.Ссылка.Дата МЕЖДУ &Дата0 И &Дата1
		|	И (ЗаказНаПроизводство2_2Продукция.Ссылка.Подразделение В (&ДиспетчерыВыпуска)
		|			ИЛИ &ДиспетчерыВыпуска ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура,
		|	ЗаказНаПроизводство2_2Продукция.Спецификация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура.Код";
		//"ВЫБРАТЬ
		//|	ПланПроизводстваПродукция.Номенклатура КАК Номенклатура,
		//|	СУММА(ПланПроизводстваПродукция.Количество) КАК Количество,
		//|	ПланПроизводстваПродукция.Спецификация КАК Спецификация
		//|ИЗ
		//|	Документ.ПланПроизводства.Продукция КАК ПланПроизводстваПродукция
		//|ГДЕ
		//|	ПланПроизводстваПродукция.Ссылка.Проведен
		//|	И ПланПроизводстваПродукция.Ссылка.Дата МЕЖДУ &Дата0 И &Дата1
		//|	И НЕ ПланПроизводстваПродукция.Полуфабрикат
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ПланПроизводстваПродукция.Номенклатура,
		//|	ПланПроизводстваПродукция.Спецификация
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ПланПроизводстваПродукция.Номенклатура.Код";
	Запрос.УстановитьПараметр("Дата0",ДатаНачала);
	Запрос.УстановитьПараметр("Дата1",ДатаОкончания);
	Запрос.УстановитьПараметр("ДиспетчерыВыпуска",ДиспетчерыВыпуска);
	// Если пользователь уже добавил изделия вручную — используем их
	// Если изделий нет — загружаем из заказов на производство за период
	Если Изделия.Количество() = 0 тогда
		Изделия.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
КонецПроцедуры

Процедура РассчитатьМатериалы(Склады, МенеджерВТ)
	Материалы.Очистить();
	Если Изделия.Количество()<=0 тогда
		ВызватьИсключение "Не заполнены изделия";
	КонецЕсли;
	
	МенеджерВТ = ЭТП.РасчитатьМатериалы(Изделия, РазузловыватьПолуфабрикатыПроизводимыеНаСтороне);
	ЗаполнитьТЗ(МенеджерВТ, Склады);
	
	Для каждого СТЗ из Материалы цикл 
		СтрОст = ТЗОстатки.Найти(СТЗ.Номенклатура, "Номенклатура");
		Если СтрОст <> Неопределено тогда
			СТЗ.НаСкладе = СтрОст.Количество;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция РасчитатьТрудозатраты(МенеджерВТ)
	ВидыРаботФиктивные = Справочники.ВидыРаботСотрудников.НайтиПоНаименованию("Фиктивные");
	
	ЭТП.ПолучитьСборки(МенеджерВТ);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = ТекстЗапросаТрудозатраты();
	Запрос.УстановитьПараметр( "ВидыРаботФиктивные", ВидыРаботФиктивные);
	Запрос.УстановитьПараметр( "Дата", ТекущаяДата());
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗаполнитьКоличествоИзделий(Трудозатраты)
	Трудозатраты.Колонки.Добавить("КоличествоИ", Изделия.ВыгрузитьКолонки().Колонки.Количество.ТипЗначения);
	Для каждого СтрТ из Трудозатраты цикл
		СтрИ = Изделия[СтрТ.Индекс];
		СтрТ.КоличествоИ = СтрИ.Количество;
	КонецЦикла;
	Для каждого СтрМ из Материалы цикл
		СтрИ = Изделия[СтрМ.КоличествоИ];
		СтрМ.КоличествоИ = СтрИ.Количество; 
		СтрМ.СпецификацияИ = СтрИ.Спецификация;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТЗ(МенеджерВТ, Склады)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	  
	Запрос.Текст = ТекстЗапросаМатериалы(); 
	Запрос.УстановитьПараметр( "ТекущаяДата", ТекущаяДата());
	
	Материалы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК Детали
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = Детали.Номенклатура
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Склад В(&Склады)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНоменклатура";
	Запрос.УстановитьПараметр( "Склады", Склады );
	ТЗОстатки = Запрос.Выполнить().Выгрузить();	
КонецПроцедуры

Функция ТекстЗапросаМатериалы();
	Возврат
	"ВЫБРАТЬ
	|	ВТМат.Номенклатура КАК Номенклатура,
	|	ВТМат.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВТМат.Подразделение КАК Подразделение,
	|	СУММА(ВТМат.Количество) КАК Количество,
	|	ВТМат.ГолСпец.ОсновноеИзделиеНоменклатура КАК Изделие,
	|	ВТМат.СпецификацияКуда.ОсновноеИзделиеНоменклатура КАК Сборка,
	|	ВТМат.Индекс КАК Индекс
	|ПОМЕСТИТЬ ВТМат1
	|ИЗ
	|	ВТМат КАК ВТМат
	|ГДЕ
	|	(ВТМат.СпецификацияЧто.Ссылка ЕСТЬ NULL
	|			ИЛИ ВТМат.СтатьяКалькуляции.ИдентификаторДляФормул = ""ПолуфабрикатыПроизводимыеНаСтороне"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТМат.Номенклатура,
	|	ВТМат.СтатьяКалькуляции,
	|	ВТМат.Подразделение,
	|	ВТМат.ГолСпец.ОсновноеИзделиеНоменклатура,
	|	ВТМат.СпецификацияКуда.ОсновноеИзделиеНоменклатура,
	|	ВТМат.Индекс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТМат1.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	ВТМат1 КАК ВТМат1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазрешениеНаЗаменуМатериаловМатериалы.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТСЗаменой
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазрешениеНаЗаменуМатериалов.Материалы КАК РазрешениеНаЗаменуМатериаловМатериалы
	|		ПО ВТНоменклатура.Номенклатура = РазрешениеНаЗаменуМатериаловМатериалы.Номенклатура
	|ГДЕ
	|	РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.Проведен
	|	И РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.Статус.Порядок = 1
	|	И РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.ДатаНачалаДействия <= &ТекущаяДата
	|	И (РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.ДатаОкончанияДействия >= &ТекущаяДата
	|			ИЛИ РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазрешениеНаЗаменуМатериаловМатериалы.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТСборкиСЗаменой
	|ИЗ
	|	ВТМат1 КАК ВТМат1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазрешениеНаЗаменуМатериалов.Материалы КАК РазрешениеНаЗаменуМатериаловМатериалы
	|		ПО ВТМат1.Сборка = РазрешениеНаЗаменуМатериаловМатериалы.Номенклатура
	|ГДЕ
	|	РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.Проведен
	|	И РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.Статус.Порядок = 1
	|	И РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.ДатаНачалаДействия <= &ТекущаяДата
	|	И (РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.ДатаОкончанияДействия >= &ТекущаяДата
	|			ИЛИ РазрешениеНаЗаменуМатериаловМатериалы.Ссылка.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТМат1.Номенклатура КАК Номенклатура,
	|	ВТМат1.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВТМат1.Подразделение КАК Подразделение,
	|	ВТМат1.Количество КАК Количество,
	|	ВТМат1.Изделие КАК Изделие,
	|	ВТМат1.Сборка КАК Сборка,
	|	НЕ ВТСЗаменой.Номенклатура ЕСТЬ NULL КАК ДействуетРазрешениеНаЗамену,
	|	НЕ ВТСборкиСЗаменой.Номенклатура ЕСТЬ NULL КАК ДействуетРазрешениеНаЗамену1,
	|	ВТМат1.Индекс КАК КоличествоИ
	|ИЗ
	|	ВТМат1 КАК ВТМат1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСЗаменой КАК ВТСЗаменой
	|		ПО ВТМат1.Номенклатура = ВТСЗаменой.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСборкиСЗаменой КАК ВТСборкиСЗаменой
	|		ПО ВТМат1.Сборка = ВТСборкиСЗаменой.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТМат1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСЗаменой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСборкиСЗаменой";
КонецФункции

Функция ТекстЗапросаТрудозатраты();
	Возврат
	"ВЫБРАТЬ
	|	ВТСборки.Спецификация.ОсновноеИзделиеНоменклатура КАК Сборка,
	|	РесурсныеСпецификацииТрудозатраты.ВидРабот КАК ВидРабот,
	|	ЕСТЬNULL(РасценкиРаботСотрудниковСрезПоследних.Расценка, 0) КАК Расценка,
	|	РесурсныеСпецификацииТрудозатраты.Количество * ВТСборки.Количество / ВТСборки.ВыходноеКоличество КАК Норма,
	|	ЕСТЬNULL(РесурсныеСпецификацииТрудозатраты.Этап.Подразделение, ВТСборки.ПодразделениеПервогоЭтапа) КАК Подразделение,
	|	ВТСборки.ГолСпец.ОсновноеИзделиеНоменклатура КАК Изделие,
	|	ВТСборки.Количество КАК Количество,
	|	ВТСборки.Индекс КАК Индекс
	|ИЗ
	|	ВТСборки КАК ВТСборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.Трудозатраты КАК РесурсныеСпецификацииТрудозатраты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиРаботСотрудников.СрезПоследних(&Дата, ) КАК РасценкиРаботСотрудниковСрезПоследних
	|			ПО РесурсныеСпецификацииТрудозатраты.ВидРабот = РасценкиРаботСотрудниковСрезПоследних.ВидРабот
	|				И РесурсныеСпецификацииТрудозатраты.ВидРабот.КвалификационныйРазряд = РасценкиРаботСотрудниковСрезПоследних.КвалификационныйРазряд
	|		ПО ВТСборки.Спецификация = РесурсныеСпецификацииТрудозатраты.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(РесурсныеСпецификацииТрудозатраты.ВидРабот.Родитель <> &ВидыРаботФиктивные, ИСТИНА)";
	
//	|	РесурсныеСпецификацииТрудозатраты.ВидРабот.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	РесурсныеСпецификацииТрудозатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
//	|	РесурсныеСпецификацииТрудозатраты.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
//	|	РесурсныеСпецификацииТрудозатраты.ВидРабот.КвалификационныйРазряд КАК КвалификационныйРазряд,
КонецФункции

Функция СведенияОВнешнейОбработке() Экспорт
	Возврат ЭТП.ЗарегистрироватьВнешнийОтчет(ЭтотОбъект);
КонецФункции
